#ifndef __HARDWARE_H_
#define __HARDWARE_H_



/*
 * Тип: Синглетон
 * Описание: Модуль определения версии платформы.
 * TODO: Для полноценного использования автоматического определения версии платы, и дальнейшей инициализации в зависимости от версии придется
 * переписать все части когда, использующие макросы в качестве задающих параметров периферии. Например: SIM900_UART, MDB_UART..
 * Сейчас выбор версии выбирается макросом HW_VERSION при компиляции. Подробности в defines.h
 *
 * A7, C4, C5
 *
 */




class Hardware
{
public:
	static Hardware *get();

	Hardware();
	uint32_t getVersion();

private:
	uint32_t version;
};

#endif
