#ifdef PSI
/*

Порядок действий:

1.	подключаем кабели для тестирования DEX и MDB, подключаем питание
2.	загораются светодиоды одним цветом
3.	тестировщик нажимает кнопку 1, если все ок
4.	загораются светодиоды другим цветом
5.	тестировщик нажимает кнопку 2
6.	играет динамик
7.	тестировщик нажимает кнопку 3
Теперь, когда мы протестировали диоды и кнопки, можно пользоваться ими для вывода информации о других тестах

1.	все светодиоды загораются красным
2.	запускается тест GSM, если он проходит, верхний диод загорается зеленым
3.	запускается тест DEX,  если он проходит, второй диод загорается зеленым
4.	запускается тест MDB, если он проходит, третий диод загорается зеленым
5.	запускается тест ETH, если он проходит, четвертый диод загорается зеленым
6.	все тесты прошли, играет музыка.

*/

#pragma once

#include "config.h"
#include "Psi.h"

class FastPsi: public Psi
{
public:
	FastPsi();

	void start();

private:

	void testLeds();
	bool testUart_Debug();

};

void fastPsiMain();
#endif

